# Introduction to SQL

In [1]:
import pandas as pd
import sqlite3

## Assignment - Part 1, Querying a Database

How many total Characters are there?

In [2]:
conn = sqlite3.connect('rpg_db.sqlite3')
curs = conn.cursor()
query = 'SELECT COUNT(*) FROM charactercreator_character;'
curs.execute(query).fetchall()

[(302,)]

How many of each specific subclass? (Note: Necromancers are mages.)

In [3]:
query = 'SELECT COUNT(*) FROM charactercreator_cleric;'
curs.execute(query).fetchall()

[(75,)]

In [4]:
query = 'SELECT COUNT(*) FROM charactercreator_fighter;'
curs.execute(query).fetchall()

[(68,)]

In [5]:
query = 'SELECT COUNT(*) FROM charactercreator_mage;'
curs.execute(query).fetchall()

[(108,)]

In [6]:
query = 'SELECT COUNT(*) FROM charactercreator_necromancer;'
curs.execute(query).fetchall()

[(11,)]

In [7]:
query = 'SELECT COUNT(*) FROM charactercreator_thief;'
curs.execute(query).fetchall()

[(51,)]

How many total Items?

In [8]:
query = 'SELECT COUNT(*) FROM armory_item'
curs.execute(query).fetchall()

[(174,)]

How many of the Items are weapons?

In [9]:
query = 'SELECT COUNT(*) FROM armory_weapon'
curs.execute(query).fetchall()

[(37,)]

How many are not?

In [10]:
query = ('SELECT COUNT(*) FROM armory_item '
         'WHERE item_id NOT IN (SELECT item_ptr_id FROM armory_weapon)')
curs.execute(query).fetchall()

[(137,)]

In [11]:
%timeit curs.execute(query).fetchall()

63.1 µs ± 780 ns per loop (mean ± std. dev. of 7 runs, 10000 loops each)

In [12]:
query = ('SELECT COUNT(*) FROM armory_item '
         'LEFT OUTER JOIN armory_weapon ON item_id = item_ptr_id '
         'WHERE item_ptr_id IS NULL')
curs.execute(query).fetchall()

[(137,)]

In [13]:
%timeit curs.execute(query).fetchall()

71 µs ± 5.33 µs per loop (mean ± std. dev. of 7 runs, 10000 loops each)

How many Items does each character have? (Return first 20 rows)

In [14]:
query = ('SELECT character.character_id, COUNT(item_id) '
         'FROM charactercreator_character AS character '
         'LEFT OUTER JOIN charactercreator_character_inventory AS inventory '
         'ON character.character_id = inventory.character_id '
         'GROUP BY character.character_id '
         'LIMIT 20')
curs.execute(query).fetchall()

[(1, 3),
 (2, 3),
 (3, 2),
 (4, 4),
 (5, 4),
 (6, 1),
 (7, 5),
 (8, 3),
 (9, 4),
 (10, 4),
 (11, 3),
 (12, 3),
 (13, 4),
 (14, 4),
 (15, 4),
 (16, 1),
 (17, 5),
 (18, 5),
 (19, 3),
 (20, 1)]

How many Weapons does each character have? (Return first 20 rows)

In [15]:
query = ('SELECT character.character_id, COUNT(item_ptr_id) '
         'FROM charactercreator_character AS character '
         'JOIN charactercreator_character_inventory AS inventory '
         'ON character.character_id = inventory.character_id '
         'LEFT OUTER JOIN armory_weapon ON inventory.item_id = item_ptr_id '
         'GROUP BY character.character_id '
         'LIMIT 20')
curs.execute(query).fetchall()

[(1, 0),
 (2, 0),
 (3, 0),
 (4, 0),
 (5, 2),
 (6, 0),
 (7, 1),
 (8, 0),
 (9, 0),
 (10, 0),
 (11, 1),
 (12, 0),
 (13, 0),
 (14, 0),
 (15, 0),
 (16, 0),
 (17, 0),
 (18, 0),
 (19, 0),
 (20, 1)]

On average, how many Items does each character have?

In [16]:
query = ('SELECT AVG(num_items) FROM '
         '(SELECT COUNT(item_id) AS num_items '
         'FROM charactercreator_character AS character '
         'LEFT OUTER JOIN charactercreator_character_inventory AS inventory '
         'ON character.character_id = inventory.character_id '
         'GROUP BY character.character_id)')
curs.execute(query).fetchall()

[(2.9735099337748343,)]

On average, how many Weapons does each character have?

In [17]:
query = ('SELECT AVG(num_weapons) FROM '
         '(SELECT character.character_id, COUNT(item_ptr_id) AS num_weapons '
         'FROM charactercreator_character AS character '
         'LEFT OUTER JOIN charactercreator_character_inventory AS inventory '
         'ON character.character_id = inventory.character_id '
         'LEFT OUTER JOIN armory_weapon ON inventory.item_id = item_ptr_id '
         'GROUP BY character.character_id)')
curs.execute(query).fetchall()

[(0.6721854304635762,)]

In [18]:
df = pd.read_csv('buddymove_holidayiq.csv')

In [19]:
conn = sqlite3.connect('buddymove_holidayiq.sqlite3')

In [20]:
df.to_sql('review', conn, if_exists='replace')

C:\Users\Me\Anaconda3\lib\site-packages\pandas\core\generic.py:2531: UserWarning: The spaces in these column names will not be changed. In pandas versions < 0.14, spaces were converted to underscores.
  dtype=dtype, method=method)

In [21]:
curs = conn.cursor()

In [22]:
query = 'SELECT COUNT(*) FROM review'
curs.execute(query).fetchall()

[(249,)]

In [23]:
df.head()

  User Id  Sports  Religious  Nature  Theatre  Shopping  Picnic
0  User 1       2         77      79       69        68      95
1  User 2       2         62      76       76        69      68
2  User 3       2         50      97       87        50      75
3  User 4       2         68      77       95        76      61
4  User 5       2         98      54       59        95      86